vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/qs-scope/usb_device.c
//*****************************************************************************
//
// usb_device.c - Functions handling USB device operation for the
//                Quickstart Oscilloscope.
//
// Copyright (c) 2008-2009 Luminary Micro, Inc.  All rights reserved.
// Software License Agreement
// 
// Luminary Micro, Inc. (LMI) is supplying this software for use solely and
// exclusively on LMI's microcontroller products.
// 
// The software is owned by LMI and/or its suppliers, and is protected under
// applicable copyright laws.  All rights are reserved.  You may not combine
// this software with "viral" open-source software in order to form a larger
// program.  Any use in violation of the foregoing restrictions may subject
// the user to criminal sanctions under applicable laws, as well as to civil
// liability for the breach of the terms and conditions of this license.
// 
// THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
// OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
// LMI SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
// CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 4781 of the EK-LM3S3748 Firmware Package.
//
//*****************************************************************************

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/usb.h"
#include "driverlib/rom.h"
#include "grlib/grlib.h"
#include "usblib/usblib.h"
#include "usblib/usb-ids.h"
#include "usblib/device/usbdevice.h"
#include "utils/uartstdio.h"
#include "data-acq.h"
#include "qs-scope.h"
#include "renderer.h"
#include "usbdescriptors.h"
#include "usbhw.h"
#include "usb_host.h"
#include "usb_protocol.h"

//*****************************************************************************
//
// This enumeration holds the various states that the endpoints can be in
// during normal operation.
//
//*****************************************************************************
typedef enum
{
    //
    // Unconfigured.
    //
    USBDEV_STATE_UNCONFIGURED,

    //
    // No outstanding transaction remains to be completed.
    //
    USBDEV_STATE_IDLE,

    //
    // Waiting on completion of a send or receive transaction.  For the OUT
    // endpoint, this indicates that the device has not processed the last
    // packet and another is waiting to be read and ACKed in the FIFO.  For
    // the IN endpoint, this means we have sent a packet but have not yet
    // received the ACK for it.
    //
    USBDEV_STATE_WAIT_DATA
}
tUSBEndpointState;

volatile tUSBEndpointState g_eDataInState;
volatile tUSBEndpointState g_eDataOutState;

//*****************************************************************************
//
// This enumeration holds the various states that the device can be in during
// normal operation.
//
//*****************************************************************************
typedef enum
{
    //
    // The device is disconnected from the host.
    //
    DEVICE_DISCONNECTED,

    //
    // The device is connected to the host but has not received a HOST_HELLO
    // packet to initiate communication.
    //
    DEVICE_WAITING_FOR_HELLO,

    //
    // The device has successfully received a HOST_HELLO packet and responded
    // with HELLO_RESPONSE.  Normal communication is ongoing.
    //
    DEVICE_COMMUNICATING
}
tUSBDeviceState;

tUSBDeviceState g_eDeviceState;
tBoolean g_bDataEnabled;
volatile tBoolean g_bBlockSend;

//*****************************************************************************
//
// The number of SysTick ticks we will wait when trying to send data before
// we declare a timeout and give up.  This equates to 0.5 seconds.
//
//*****************************************************************************
#define USB_DATA_TIMEOUT_TICKS  (SYSTICKS_PER_SECOND / 2)

//*****************************************************************************
//
// Buffers used to hold data received from the host and a global holding the
// number of bytes of data in the receive (OUT) buffer.
//
//*****************************************************************************
static unsigned char g_pucDataOutBuffer[DATA_IN_EP_MAX_SIZE];
static unsigned long g_ulDataOutSize;

//*****************************************************************************
//
// Macros holding the maximum number of tScopeDataElement and
// tScopeDualDataElement entries that can be transmitted in a
// single SCOPE_PKT_DATA packet.
//
//*****************************************************************************
#define SINGLE_ELEMENTS_PER_PACKET                          \
                                ((DATA_IN_EP_MAX_SIZE -     \
                                  sizeof(tScopePacket)) /   \
                                 sizeof(tScopeDataElement))
#define DUAL_ELEMENTS_PER_PACKET                                \
                                ((DATA_IN_EP_MAX_SIZE -         \
                                  sizeof(tScopePacket)) /       \
                                 sizeof(tScopeDualDataElement))

//*****************************************************************************
//
// Global flag indicating that a USB configuration has been set.
//
//*****************************************************************************
static volatile unsigned long g_ulUSBConfigured;

//*****************************************************************************
//
// Global flags used to indicate to the transmit path that a response to a
// PING or HELLO from the host is required.
//
//*****************************************************************************
static tBoolean g_bSendHelloResponse;
static tBoolean g_bSendPingResponse;
static unsigned char g_ucPingEcho1;
static unsigned long g_ulPingEcho2;

//*****************************************************************************
//
// Internal function prototypes.
//
//*****************************************************************************
static void ProcessDataFromHost(unsigned long ulStatus);
static void ProcessDataToHost(unsigned long ulStatus);
static tBoolean SendUSBPacket(tScopePacket *psHeader, unsigned char *pucData,
                              unsigned long ulLength);
static void CleanUpOnDisconnect(tBoolean bInformUser);
static tBoolean WaitForUSBSendIdle(unsigned long ulTimeout);

//*****************************************************************************
//
// Send the SCOPE_PKT_HELLO_RESPONSE packet and current settings back to the
// USB host.
//
//*****************************************************************************
static void
SendHelloResponse(void)
{
    tScopePacket sPacket;
    tScopeSettings sSettings;
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usLevel;
    tBoolean bTriggerCh1;
    tBoolean bRetcode;

    //
    // Are we free to send the data just now?
    //
    if((g_eDataInState == USBDEV_STATE_IDLE) && !g_bBlockSend)
    {
        sPacket.ucVersion = SCOPE_PROTOCOL_VERSION_1;
        sPacket.ucHdrLength = sizeof(tScopePacket);
        sPacket.ucPacketType = SCOPE_PKT_HELLO_RESPONSE;
        sPacket.ucParam = 0;
        sPacket.ulParam = 0;
        sPacket.ulDataLength = sizeof(tScopeSettings);

        //
        // The payload of the HELLO_RESPONSE packet contains the current
        // application settings that are relevant to allow the host to
        // correctly configure its user interface.
        //
        sSettings.ulTriggerLevelmV = g_sRender.lTriggerLevelmV;
        sSettings.ulTimebaseuS = g_sRender.uluSPerDivision;
        sSettings.lTriggerPos = g_sRender.lHorizontalOffset;
        sSettings.sChannel1OffsetmV = g_sRender.lVerticalOffsetmV[CHANNEL_1];
        sSettings.sChannel2OffsetmV = g_sRender.lVerticalOffsetmV[CHANNEL_2];
        sSettings.usChannel1ScalemVdiv = g_sRender.ulmVPerDivision[CHANNEL_1];
        sSettings.usChannel2ScalemVdiv = g_sRender.ulmVPerDivision[CHANNEL_2];
        sSettings.ucChannel2Enabled = g_pbActiveChannels[CHANNEL_2];
        sSettings.ucStarted = g_bContinuousCapture;

        //
        // Get the trigger type.  We make the (currently valid) assumption that
        // the members of tTriggerType align with the SCOPE_TRIGGER_TYPE_XXX
        // definitions from usb_protocol.h.
        //
        DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usLevel);
        bTriggerCh1 = DataAcquisitionGetTriggerChannel();

        sSettings.ucTriggerType = (unsigned char)eType;
        sSettings.ucTriggerChannel = bTriggerCh1 ? SCOPE_CHANNEL_1 :
                                                   SCOPE_CHANNEL_2;

        //
        // Write the packet data to the USB endpoint FIFO.
        //
        bRetcode = SendUSBPacket(&sPacket, (unsigned char *)&sSettings,
                                 sizeof(tScopeSettings));
        if(bRetcode)
        {
            //
            // We sent the response so turn off the flag telling us to do this.
            //
            g_bSendHelloResponse = false;

            //
            // Update our device state to indicate that normal communication
            // is now possible.
            //
            g_eDeviceState = DEVICE_COMMUNICATING;

            //
            // Inform the main loop that the host is disconnecting.
            //
            COMMAND_FLAG_WRITE(SCOPE_USB_HOST_CONNECT, 0);
        }
    }
    else
    {
        //
        // We're waiting for a previous packet to be sent so can't send the
        // response right now.  Set a flag to ourselves telling us to send
        // this response next time the transmitter is available.
        //
        g_bSendHelloResponse = true;
    }
}

//*****************************************************************************
//
// Send the SCOPE_PKT_PING_RESPONSE packet back to the USB host.
//
//*****************************************************************************
static void
SendPingResponse(unsigned char ucEcho1, unsigned long ulEcho2)
{
    tScopePacket sPacket;

    //
    // If no outstanding transmission is pending, go ahead and send the
    // response immmediately.
    //
    if((g_eDataInState == USBDEV_STATE_IDLE) && !g_bBlockSend)
    {
        sPacket.ucVersion = SCOPE_PROTOCOL_VERSION_1;
        sPacket.ucHdrLength = sizeof(tScopePacket);
        sPacket.ucPacketType = SCOPE_PKT_PING_RESPONSE;
        sPacket.ucParam = ucEcho1;
        sPacket.ulParam = ulEcho2;
        sPacket.ulDataLength = 0;

        //
        // Mark the fact that we don't have a ping response pending any
        // more.
        //
        g_bSendPingResponse = false;

        //
        // Write the packet data to the USB endpoint FIFO.
        //
        SendUSBPacket(&sPacket, (unsigned char *)0, 0);
    }
    else
    {
        //
        // We're waiting for a previous packet to be sent so can't send the
        // response right now.  Flag this so that we send the response later.
        //
        g_bSendPingResponse = true;
        g_ucPingEcho1 = ucEcho1;
        g_ulPingEcho2 = ulEcho2;
  }
}

//*****************************************************************************
//
// Handles USB packets received from the host.
//
// \param pcPacket points to the first byte of a received packet.
// \param ulSize is the size in bytes of the packet pointed to by \e pcPacket.
//
// This function is called in interrupt context whenever a new packet has
// been read from the USB host.  Here we parse the packet and pass on any
// orders it contains to the main loop for later action.
//
// In the current version of the protocol, all transactions from the host
// are contained in a single USB packet with no additional data so we
// don't need to worry about variable sized data here or transactions that
// span more than one packet.
//
// \return None.
//
//*****************************************************************************
void
ProcessUSBPacket(unsigned char *pcPacket, unsigned long ulSize)
{
    tScopePacket *psPacket;

    //
    // Get a pointer to our packet header structure.
    //
    psPacket = (tScopePacket *)pcPacket;

    //
    // Check the validity of the packet we just received.
    //
    if(psPacket->ucVersion != SCOPE_PROTOCOL_VERSION_1)
    {
        //
        // Someone is asking for a protocol later than we support or
        // is sending us bogus packets.  Check to see if this is a
        // a HOST_HELLO packet to determine which of these is the case.
        //
        if(!((psPacket->ucPacketType == SCOPE_PKT_HOST_HELLO) &&
           (ulSize == psPacket->ucHdrLength)))
        {
            //
            // This is not a HOST_HELLO packet with the expected length
            // so we assume it's either invalid or something we can't handle
            // and merely ignore it.
            //
            UARTprintf("Unexpected USB packet\n");
            return;
        }
        else
        {
            //
            // This is something other than a HOST_HELLO packet.  We don't
            // support this level of the protocol and the host hasn't
            // sent us the HELLO packet so we ignore this completely.
            UARTprintf("USB packet ignored\n");
            return;
        }
    }
    else
    {
        //
        // Seems to be a packet using the protocol version we support so
        // all seems well so far.  Check that the header length is correct
        // for this protocol version.
        //
        if(psPacket->ucHdrLength != sizeof(tScopePacket))
        {
            //
            // Header length is wrong so ignore the packet.
            //
            UARTprintf("USB header error - wrong length\n");
            return;
        }
    }

    //
    // Parse the packet and send the appropriate command to the main loop.
    //
    switch(psPacket->ucPacketType)
    {
        case SCOPE_PKT_HOST_HELLO:
        {
            //
            // We respond with a HELLO_RESPONSE packet.  Don't update the state
            // until this is actually sent, though.
            //
            SendHelloResponse();
            break;
        }

