vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/qs-scope/usb_device.c
        case SCOPE_PKT_HOST_GOODBYE:
        {
            //
            // The host application is closing down so go back to the state
            // where we are waiting for a HOST_HELLO packet.
            //
            g_eDeviceState = DEVICE_WAITING_FOR_HELLO;

            //
            // Inform the main loop that the host is disconnecting.
            //
            COMMAND_FLAG_WRITE(SCOPE_USB_HOST_REMOVE, 0);
            break;
        }

        case SCOPE_PKT_PING:
        {
            //
            // We respond with a PING_RESPONSE packet.
            //
            SendPingResponse(psPacket->ucParam, psPacket->ulParam);
            break;
        }

        case SCOPE_PKT_CAPTURE:
        {
            //
            // Send a command to the main loop asking to capture a frame.
            //
            COMMAND_FLAG_WRITE(SCOPE_CAPTURE, 0);
            break;
        }

        case SCOPE_PKT_START:
        {
            //
            // Send a command to the main loop to start automatic capture.
            //
            COMMAND_FLAG_WRITE(SCOPE_START, 0);
            break;
        }

        case SCOPE_PKT_STOP:
        {
            //
            // Send a command to the main loop to start automatic capture.
            //
            COMMAND_FLAG_WRITE(SCOPE_STOP, 0);
            break;
        }

        case SCOPE_PKT_SET_TIMEBASE:
        {
            //
            // Send a command to the main loop to set the capture timebase.
            //
            COMMAND_FLAG_WRITE(SCOPE_CHANGE_TIMEBASE, psPacket->ulParam);
            break;
        }

        case SCOPE_PKT_SET_TRIGGER_TYPE:
        {
            //
            // Send commands to the main loop to set the trigger type and
            // channel.
            //
            COMMAND_FLAG_WRITE(SCOPE_CHANGE_TRIGGER, psPacket->ulParam);
            COMMAND_FLAG_WRITE(SCOPE_SET_TRIGGER_CH,
                               ((psPacket->ucParam == SCOPE_CHANNEL_1) ?
                                CHANNEL_1 : CHANNEL_2));
            break;
        }

        case SCOPE_PKT_SET_TRIGGER_LEVEL:
        {
            //
            // Send a command to the main loop to set the trigger level.
            //
            COMMAND_FLAG_WRITE(SCOPE_TRIGGER_LEVEL, psPacket->ulParam);
            break;
        }

        case SCOPE_PKT_SET_TRIGGER_POS:
        {
            //
            // Send a command to the main loop to set the trigger position.
            //
            COMMAND_FLAG_WRITE(SCOPE_TRIGGER_POS, psPacket->ulParam);
            break;
        }

        case SCOPE_PKT_SET_CHANNEL2:
        {
            //
            // Send a command to the main loop to enable or disable channel
            // 2 as required.
            //
            COMMAND_FLAG_WRITE(SCOPE_CH2_DISPLAY,
                               (unsigned long)psPacket->ucParam);
            break;
        }

        case SCOPE_PKT_RETRANSMIT:
        {
            //
            // Send a command to the main loop to have it retransmit the latest
            // captured waveform data.
            //
            COMMAND_FLAG_WRITE(SCOPE_RETRANSMIT, 0);
            break;
        }

        case SCOPE_PKT_DATA_CONTROL:
        {
            //
            // Set or clear the flag we use to gate data transmission to '
            // the host.
            //
            g_bDataEnabled = (tBoolean)psPacket->ucParam;
            break;
        }

        case SCOPE_PKT_FIND:
        {
            //
            // Send a command to the main loop to have it rescale and
            // reposition the appropriate waveform.
            //
            COMMAND_FLAG_WRITE(SCOPE_FIND,
                               ((psPacket->ucParam == SCOPE_CHANNEL_1) ?
                                  CHANNEL_1 : CHANNEL_2));
            break;
        }

        case SCOPE_PKT_SET_POSITION:
        {
            //
            // Send a command to the main loop to have it reposition the
            // appropriate waveform.
            //
            COMMAND_FLAG_WRITE(((psPacket->ucParam == SCOPE_CHANNEL_1) ?
                                  SCOPE_CH1_POS : SCOPE_CH2_POS),
                               psPacket->ulParam);
            break;
        }

        case SCOPE_PKT_SET_SCALE:
        {
            //
            // Send a command to the main loop to have it rescale the
            // appropriate waveform.
            //
            COMMAND_FLAG_WRITE(((psPacket->ucParam == SCOPE_CHANNEL_1) ?
                                  SCOPE_CH1_SCALE : SCOPE_CH2_SCALE),
                               psPacket->ulParam);
            break;
        }

        //
        // Handle all unrecognized packets.
        //
        default:
        {
            //
            // We received an unrecognized packet.  Ignore it.
            //
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called from HandleEndpoints for all interrupts signalling
// the arrival of data on the bulk OUT endpoint (in other words, whenever
// the host has sent us data).  We read the data into our local buffer assuming
// it has already been emptied and ACK the data.  If the buffer is not yet
// available, we merely return without doing anything.  The USB hardware will
// continue to NACK the data until we later read the new packet from the
// FIFO and ACK it.
//
// NOTE: This function must not block since it is called from interrupt
// context.
//
//*****************************************************************************
static void
ProcessDataFromHost(unsigned long ulStatus)
{
    unsigned long ulCount;
    int iRetcode;

    switch(g_eDataOutState)
    {
        case USBDEV_STATE_UNCONFIGURED:
            //
            // Weird - we got a packet before the configuration was set.
            // Just handle it as normal anyway.
            //
        case USBDEV_STATE_IDLE:
        {
            //
            // Read the packet we got into the local buffer and keep track of
            // its size.
            //
            ulCount = DATA_OUT_EP_MAX_SIZE;
            iRetcode =  USBEndpointDataGet(USB0_BASE, DATA_OUT_ENDPOINT,
                                           g_pucDataOutBuffer,
                                           &ulCount);
            //
            // Was there a packet to read?
            //
            if(iRetcode != -1)
            {
                g_ulDataOutSize = ulCount;

                //
                //
                // ACK the packet.  This tells the host that it is free to send
                // the next one.
                //
                USBDevEndpointDataAck(USB0_BASE, DATA_OUT_ENDPOINT, true);

                //
                // Parse the packet contents and send appropriate commands to
                // the main loop.
                //
                ProcessUSBPacket(g_pucDataOutBuffer, g_ulDataOutSize);
            }

            //
            // We have handled the packet so jump back to idle state and wait
            // for the next one.
            //
            g_eDataOutState = USBDEV_STATE_IDLE;

            break;
        }

        case USBDEV_STATE_WAIT_DATA:
        {
            //
            // We shouldn't get here.  This implies that we received a second
            // packet while we still had one in the FIFO which is not ACKed.
            //
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called from HandleEndpoints for all interrupts originating
// from the bulk IN endpoint (in other words, whenever data has been
// transmitted to the USB host).
//
//*****************************************************************************
static void
ProcessDataToHost(unsigned long ulStatus)
{
    if(ulStatus)
    {
        //
        // Clear the status bits.
        //
        USBDevEndpointStatusClear(USB0_BASE, DATA_IN_ENDPOINT, ulStatus);
    }

    //
    // Our IN endpoint is now idle.
    //
    g_eDataInState = USBDEV_STATE_IDLE;

    //
    // Our last transmission completed.  Do we need to send any further data
    // or are we finished?
    //
    if(g_bSendHelloResponse)
    {
        //
        // We need to send a HELLO response packet so do this now.
        //
        SendHelloResponse();
    }
    else
    {
        //
        // Do we have a pending PING_RESPONSE to send?
        //
        if(g_bSendPingResponse)
        {
            SendPingResponse(g_ucPingEcho1, g_ulPingEcho2);
        }
    }
}

//*****************************************************************************
//
// This function sends a single packet with optional data block to the USB
// host.
//
// \note This rather simplified function will not allow more data to be sent
// than there is space in the USB FIFO for the data IN endpoint.
//
// \return Returns \b true if the packet was scheduled to be sent or \b false
// if an error occurred.
//
//*****************************************************************************
static tBoolean
SendUSBPacket(tScopePacket *psHeader, unsigned char *pucData,
              unsigned long ulLength)
{
    int iRetcode;

    //
    // Put the packet header into the transmit FIFO.
    //
    iRetcode = USBEndpointDataPut(USB0_BASE, DATA_IN_ENDPOINT,
                                  (unsigned char *)psHeader,
                                  sizeof(tScopePacket));
    if(iRetcode == 0)
    {
        //
        // If the packet has optional data, send this too.
        //
        if(ulLength != 0)
        {
            iRetcode = USBEndpointDataPut(USB0_BASE, DATA_IN_ENDPOINT,
                                          pucData, ulLength);
        }

        //
        // Did we manage to put all the data into the USB FIFO?
        //
        if(iRetcode == 0)
        {
            //
            // We successfully put the data in the FIFO so now initiate the
            // transmission.
            //
            g_eDataInState = USBDEV_STATE_WAIT_DATA;
            iRetcode = USBEndpointDataSend(USB0_BASE, DATA_IN_ENDPOINT,
                                           USB_TRANS_IN);
            if(iRetcode != 0)
            {
                //
                // USBEndpointDataSend failed!
                //
                return(false);
            }
        }
        else
        {
            //
            // USBEndpointDataPut for the payload failed!
            //
            return(false);
        }
    }
    else
    {
        //
        // USBEndpointDataPut for the header failed!
        //
        return(false);
    }

    //
    // If we get here, things must have gone well
    //
    return(true);
}

//****************************************************************************
//
// This function configures the oscilloscope USB device endpoints and
// allocates the required amount of USB controller FIFO space to support
// them.
//
//****************************************************************************
void
ScopeUSBDeviceConfigureEndpoints(void)
{
    unsigned long ulFIFOAddr;

    //
    // Configure the data IN endpoint (on which we send data to the host).
    //
    USBDevEndpointConfigSet(USB0_BASE, DATA_IN_ENDPOINT, DATA_IN_EP_MAX_SIZE,
                            USB_EP_DEV_IN | USB_EP_MODE_BULK);

    //
    // Configure the data OUT endpoint (on which we receive data from the
    // host).
    //
    USBDevEndpointConfigSet(USB0_BASE, DATA_OUT_ENDPOINT, DATA_OUT_EP_MAX_SIZE,
                            USB_EP_DEV_OUT | USB_EP_MODE_BULK);

    //
    // Configure the USB FIFO.  Note that we are responsible for providing both
    // the start address and size of each FIFO block so we need to make sure
    // none of these blocks overlap.  Endpoint 0 takes the first 64 bytes of
    // the address range so we start there.
    //
    ulFIFOAddr = 64;

    //
    // Configure data IN endpoint FIFO.
    //
    USBFIFOConfigSet(USB0_BASE, DATA_IN_ENDPOINT, ulFIFOAddr,
                     DATA_IN_EP_FIFO_SIZE, USB_EP_DEV_IN);
    ulFIFOAddr += USB_FIFO_SZ_TO_BYTES(DATA_IN_EP_FIFO_SIZE);

    //
    // Configure data OUT endpoint FIFO.
    //
    USBFIFOConfigSet(USB0_BASE, DATA_OUT_ENDPOINT, ulFIFOAddr,
                     DATA_OUT_EP_FIFO_SIZE, USB_EP_DEV_OUT);
    ulFIFOAddr += USB_FIFO_SZ_TO_BYTES(DATA_OUT_EP_FIFO_SIZE);

    //
    // Enter the idle state.
    //
    CleanUpOnDisconnect(false);
}

//*****************************************************************************
//
// Initializes the USB stack for the oscilloscope device.
//
//*****************************************************************************
tBoolean
ScopeUSBDeviceInit(void)
{
    //
    // Not configured initially.
    //
    g_ulUSBConfigured = 0;

    //
    // Enable Clocking to the USB controller and ensure it is reset.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_USB0);
    SysCtlPeripheralReset(SYSCTL_PERIPH_USB0);

    //
    // Turn on USB Phy clock.
    //
    SysCtlUSBPLLEnable();

    //
    // Configure the USB mux on the board to put us in device mode.  We pull
    // the relevant pin high to do this.
    //
    SysCtlPeripheralEnable(USB_MUX_GPIO_PERIPH);
    GPIOPinTypeGPIOOutput(USB_MUX_GPIO_BASE, USB_MUX_GPIO_PIN);
    GPIOPinWrite(USB_MUX_GPIO_BASE, USB_MUX_GPIO_PIN, USB_MUX_SEL_DEVICE);

    //
    // Detach the device using the soft connect.
    //
    USBDevDisconnect(USB0_BASE);

    //
    // Tell the stack that we will be operating as a device rather than a
    // host.  This calls back to ScopeUSBModeCallback where we perform final
    // initialization.
    //
    USBStackModeSet(0, USB_MODE_DEVICE, ScopeUSBModeCallback);

    return(true);
}

//*****************************************************************************
//
// Removes the oscilloscope USB device from the bus.
//
//*****************************************************************************
void
ScopeUSBDeviceTerm(void)
{
    //
    // Remember that we are no longer configured.
    //
    g_ulUSBConfigured = 0;

    //
    // Tell the USB library that we are no longer using the controller.
    //
    USBDCDTerm(0);
}

//*****************************************************************************
//
// This public function sends a single packet to the host and returns once
// the packet has been acknowledged.
//
// \param ucPacketType is the type of packet to send.
// \param ucParam is the first packet parameter value.
// \param ulParam is the second packet parameter value.
//
// \note This rather simplified function will not allow more data to be sent
// than there is space in the USB FIFO for the data IN endpoint.
//
// \return Returns \b true if the packet was sent successfully or \b false
// if an error occurred or we are not connected to the host.
//
//*****************************************************************************
tBoolean
ScopeUSBDeviceSendPacket(unsigned char ucPacketType, unsigned char ucParam,
                         unsigned long ulParam)
{
    tBoolean bRetcode;
    tScopePacket sPacket;

    if(g_eDeviceState == DEVICE_COMMUNICATING)
    {
        //
        // Set the flag which prevents any automatic packet transmission
        // from interrupt context while we are trying to send a packet
        // from this context.
        //
        g_bBlockSend = true;

        //
        // Wait until it is safe to send the packet.
        //
        bRetcode = WaitForUSBSendIdle(USB_DATA_TIMEOUT_TICKS);

        //
        // If we didn't time out, go ahead and send the packet.
        //
        if(bRetcode)
        {
            //
            // Fill in the packet header structure.
            //
            sPacket.ucVersion = SCOPE_PROTOCOL_VERSION_1;
            sPacket.ucHdrLength = sizeof(tScopePacket);
            sPacket.ucPacketType = ucPacketType;
            sPacket.ucParam = ucParam;
            sPacket.ulParam = ulParam;
            sPacket.ulDataLength = 0;

            //
            // ...and send it back to the host.
            //
            bRetcode = SendUSBPacket(&sPacket, 0, 0);

            //
            // If we scheduled the packet for transmission successfully,
            // wait until it has been sent.
            //
            if(bRetcode)
            {
                bRetcode = WaitForUSBSendIdle(USB_DATA_TIMEOUT_TICKS);
            }
        }
    }
    else
    {
        //
        // We are not connected to the host so discard the packet.
        //
        bRetcode = false;
    }

    //
    // Release the transmission block flag.
    //
    g_bBlockSend = false;

    return(bRetcode);
}

//*****************************************************************************
//
// This function should be called in all error conditions which cause us to
// believe that the host disconnected or which cause us to need to
// resynchronise with the host.  We clean up all state and revert to
// the original disconnected state where we wait for a SCOPE_PKT_HOST_HELLO
// and ignore all other incoming packets.  The host should recognize that it is
// no longer being communicated with and reinitiate communications after this.
//
//*****************************************************************************
static void
CleanUpOnDisconnect(tBoolean bInformUser)
{
    //
    // Get back to the default state.  We are not in communication, both
    // endpoints are idle and we are not automatically sending data back to
    // the host.
    //
    UARTprintf("USB host disconnected\n");
    g_eDataInState = USBDEV_STATE_IDLE;
    g_eDataOutState = USBDEV_STATE_IDLE;
    g_eDeviceState = DEVICE_DISCONNECTED;
    g_bDataEnabled = false;
    g_bBlockSend = false;

    //
    // Inform the main loop that the host is disconnecting.
    //
    if(bInformUser)
    {
        COMMAND_FLAG_WRITE(SCOPE_USB_HOST_REMOVE, 0);
    }
}

//*****************************************************************************
//
// This function will poll until either the USB data IN endpoint is idle or a
// timeout occurs.  The ulTimeout parameter provides the required timeout
// expressed in a number of system ticks.
//
//*****************************************************************************
static tBoolean
WaitForUSBSendIdle(unsigned long ulTimeout)
{
    unsigned long ulTimeEnd;

    //
    // What will the time be when we time out?
    //
    ulTimeEnd = g_ulSysTickCounter + ulTimeout;

    //
    // Wait for the USB endpoint to become free.
    //
    while((g_eDataInState != USBDEV_STATE_IDLE) &&
          (g_ulSysTickCounter != ulTimeEnd))
    {
        //
        // Wait around...
        //
    }

    //
    // Did we drop out of the loop because the endpoint is idle or
    // due to a timeout? Return true if the endpoint is now idle
    // or false if not (since this implies we timed out).
    //
    return(g_eDataInState == USBDEV_STATE_IDLE);
}

//*****************************************************************************
//
// This function is called by the main loop to transmit captured waveform
// data to the USB host (if connected).  The function blocks until the complete
// data set has been transmitted and acknowledged by the host.
//
// If the host is not currently connected, this function returns immediately
// indicating an error.
//
// If automatic data transmission is currently enabled, the call is ignored
// unless the \e bAuto parameter is \b false indicating that the call is the
// result of a specific request for data from the host.
//
// Note: This function must not be called from interrupt context since it
// blocks until all data is sent or a timeout occurs.
//
// \return Returns \b true on success or \b false on error.
//
//*****************************************************************************
tBoolean
ScopeUSBDeviceSendData(tDataAcqCaptureStatus *pCapInfo, tBoolean bAuto)
{
    tScopeDataStart sStartInfo;
    tScopePacket sPacket;
    tBoolean bRetcode;
    unsigned char ucPacketCount;
    unsigned long ulSampleCount;
    unsigned long ulSampleIndex;
    unsigned long ulMaxSample;
    unsigned long ulLoop;
    int iRetcode;

    //
    // We only send data if the device is connected to a USB host
    // and the host has either requested the data or enabled automatic
    // data transmission.
    //
    if((g_eDeviceState == DEVICE_COMMUNICATING) &&
       (!bAuto || (bAuto && g_bDataEnabled)))
    {
        //
        // Set the flag that signals the interrupt context code not to
        // try to send anything immediately.
        //
        g_bBlockSend = true;

        //
        // Wait for the data IN endpoint to complete sending
        // the packet.
        //
        bRetcode = WaitForUSBSendIdle(USB_DATA_TIMEOUT_TICKS);

        //
        // If we didn't time out, go ahead and send the data
        //
        if(bRetcode)
        {
            //
            // The endpoint is idle so send our data.  We first send a
            // SCOPE_PKT_DATA_START packet.
            //
            sStartInfo.ulSampleOffsetuS = pCapInfo->ulSampleOffsetuS;
            sStartInfo.ulSamplePerioduS = pCapInfo->ulSamplePerioduS;
            sStartInfo.bDualChannel = pCapInfo->bDualMode;
            sStartInfo.bCh2SampleFirst = pCapInfo->bBSampleFirst;
            sStartInfo.ulTotalElements = pCapInfo->bDualMode ?
                              (pCapInfo->ulMaxSamples / 2) :
                              pCapInfo->ulMaxSamples;

            //
            // Map the trigger index in the ring buffer to an element
            // index in the data we will be sending back to the USB host.
            //
            sStartInfo.ulTriggerIndex = DISTANCE_FROM_START(
                                              pCapInfo->ulStartIndex,
                                              pCapInfo->ulTriggerIndex,
                                              pCapInfo->ulMaxSamples);
            if(pCapInfo->bDualMode)
            {
                sStartInfo.ulTriggerIndex /= 2;
            }

            sPacket.ucVersion = SCOPE_PROTOCOL_VERSION_1;
            sPacket.ucHdrLength = sizeof(tScopePacket);
            sPacket.ucPacketType = SCOPE_PKT_DATA_START;
            sPacket.ucParam = 0;
            sPacket.ulParam = sStartInfo.ulTotalElements;
            sPacket.ulDataLength = sizeof(tScopeDataStart);
            bRetcode = SendUSBPacket(&sPacket, (unsigned char *)&sStartInfo,
                                     sizeof(tScopeDataStart));

            //
            // If we can't send the packet for some reason,
            // return an error.
            //
            if(!bRetcode)
            {
                CleanUpOnDisconnect(true);
                return(false);
            }

            //
            // Now we send the actual data samples in multiple
            // SCOPE_PKT_DATA packets.
            //
            ulSampleCount = 0;
            ulSampleIndex = pCapInfo->ulStartIndex;
            ucPacketCount = 1;
            ulMaxSample = sPacket.ulParam;
            sPacket.ucPacketType = SCOPE_PKT_DATA;

