vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/qs-scope/usb_device.c
            while(ulSampleCount < ulMaxSample)
            {
                //
                // Wait for the data IN endpoint to complete sending
                // the previous packet.
                //
                bRetcode = WaitForUSBSendIdle(USB_DATA_TIMEOUT_TICKS);

                //
                // Immediately mark the endpoint as waiting for data.  This is
                // intended to reduce the likelihood of an incoming PING or
                // HELLO packet from causing our interrupt service routine to
                // write to the USB endpoint FIFO while this function is
                // running.  There is, admittedly, still a tiny timing hole
                // here (if a USB interrupt for a PING packet is serviced
                // between WaitForUSBSendIdle and the next line, we have a
                // problem).
                //
                g_eDataInState = USBDEV_STATE_WAIT_DATA;

                if(!bRetcode)
                {
                    CleanUpOnDisconnect(true);
                    return(false);
                }

                //
                // Update the header for the new packet.
                //
                sPacket.ucParam = ucPacketCount++;

                //
                // How many samples will we send in this packet?
                //
                if(pCapInfo->bDualMode)
                {
                    sPacket.ulParam = min(DUAL_ELEMENTS_PER_PACKET,
                                          (ulMaxSample - ulSampleCount));
                    sPacket.ulDataLength = (sPacket.ulParam *
                                            sizeof(tScopeDualDataElement));
                }
                else
                {
                    sPacket.ulParam = min(SINGLE_ELEMENTS_PER_PACKET,
                                          (ulMaxSample - ulSampleCount));
                    sPacket.ulDataLength = (sPacket.ulParam *
                                            sizeof(tScopeDataElement));
                }

                //
                // Put the packet header into the transmit FIFO.
                //
                USBEndpointDataPut(USB0_BASE, DATA_IN_ENDPOINT,
                                   (unsigned char *)&sPacket,
                                    sizeof(tScopePacket));

                //
                // Now write the sample data for this packet.
                //
                for(ulLoop = 0; ulLoop < sPacket.ulParam; ulLoop++)
                {
                    //
                    // Are we dealing with single or dual channel data?
                    //
                    if(pCapInfo->bDualMode)
                    {
                        //
                        // Dual channel - send two samples per element.
                        //
                        tScopeDualDataElement sData;

                        sData.ulTimeuS = ((ulSampleCount + ulLoop) *
                                          pCapInfo->ulSamplePerioduS);
                        sData.sSample1mVolts = ADC_SAMPLE_TO_MV(
                                        pCapInfo->pusBuffer[ulSampleIndex++]);
                        sData.sSample2mVolts = ADC_SAMPLE_TO_MV(
                                        pCapInfo->pusBuffer[ulSampleIndex++]);

                        //
                        // Adjust for the wrap at the end of the ring buffer.
                        // It's fine to do this after writing both samples
                        // since the sample buffer must be a multiple of two
                        // samples long - we can't have a wrap between samples.
                        //
                        if(ulSampleIndex >= pCapInfo->ulMaxSamples)
                        {
                            ulSampleIndex -= pCapInfo->ulMaxSamples;
                        }

                        //
                        // Write the sample to the USB FIFO.
                        //
                        USBEndpointDataPut(USB0_BASE, DATA_IN_ENDPOINT,
                                           (unsigned char *)&sData,
                                            sizeof(tScopeDualDataElement));
                    }
                    else
                    {
                        //
                        // Single channel - send one sample per element.
                        //
                        tScopeDataElement sData;

                        sData.ulTimeuS = ((ulSampleCount + ulLoop) *
                                          pCapInfo->ulSamplePerioduS);
                        sData.sSamplemVolts = ADC_SAMPLE_TO_MV(
                                        pCapInfo->pusBuffer[ulSampleIndex++]);

                        //
                        // Adjust for the wrap at the end of the ring buffer.
                        //
                        if(ulSampleIndex >= pCapInfo->ulMaxSamples)
                        {
                            ulSampleIndex -= pCapInfo->ulMaxSamples;
                        }

                        //
                        // Write the sample to the USB FIFO.
                        //
                        USBEndpointDataPut(USB0_BASE, DATA_IN_ENDPOINT,
                                           (unsigned char *)&sData,
                                            sizeof(tScopeDataElement));
                    }
                }

                //
                // At this point, we've written all the data for a single data
                // packet so go ahead and send it.
                //
                iRetcode = USBEndpointDataSend(USB0_BASE, DATA_IN_ENDPOINT,
                                               USB_TRANS_IN);

                //
                // Was the transmission scheduled successfully?
                //
                if(iRetcode != 0)
                {
                    //
                    // No - something went wrong.  Handle this as if the host
                    // disconnected.
                    //
                    CleanUpOnDisconnect(true);
                    return(false);
                }

                //
                // Update our element counter for the next loop.
                //
                ulSampleCount += sPacket.ulParam;
            }

            //
            // At this point, all the data packets have been sent.  All we need
            // to do now is send a terminating SCOPE_PKT_DATA_END.
            //
            sPacket.ucPacketType = SCOPE_PKT_DATA_END;
            sPacket.ucParam = ucPacketCount;
            sPacket.ulParam = 0;
            sPacket.ulDataLength = 0;

            //
            // Wait for the data IN endpoint to complete sending
            // the previous packet.
            //
            bRetcode = WaitForUSBSendIdle(USB_DATA_TIMEOUT_TICKS);
            if(bRetcode)
            {
                bRetcode = SendUSBPacket(&sPacket, 0, 0);
            }

            if(!bRetcode)
            {
                //
                // We couldn't send the packet.  Treat this as a host
                // disconnection.
                //
                CleanUpOnDisconnect(true);
                return(false);
            }
            else
            {
                //
                // Clear the flag blocking the ISR from transmitting.
                //
                g_bBlockSend = false;
                return(true);
            }
        }
        else
        {
            //
            // We timed out waiting for the data IN endpoint to become free.
            // Something horrid happened so disconnect and wait for the host to
            // reinitiate communication.
            //
            CleanUpOnDisconnect(true);
        }
    }

    //
    // If we get here data transmission was disabled or we are
    // not connected to the host.
    //
    return(false);
}

//*****************************************************************************
//
// Called by the USB stack for any activity involving one of our endpoints
// other than EP0.  This function is a fanout that merely directs the call to
// the correct handler depending upon the endpoint and transaction direction
// signalled in ulStatus.
//
//*****************************************************************************
void
HandleEndpoints(unsigned long ulIndex, unsigned long ulStatus)
{
    //
    // Handler for the bulk OUT data endpoint.
    //
    if(ulStatus & USB_INTEP_DEV_OUT_2)
    {
        //
        // Data is being sent to us from the host.
        //
        ProcessDataFromHost(ulStatus);
        ulStatus &= ~USB_INTEP_DEV_OUT_2;
    }

    //
    // Handler for the bulk IN data endpoint.
    //
    if(ulStatus & USB_INTEP_DEV_IN_1)
    {
        ProcessDataToHost(ulStatus);
        ulStatus &= ~USB_INTEP_DEV_IN_1;
    }

    //
    // Check to see if any other interrupt causes are being signalled.  If
    // there are any we don't support, this is a problem.
    //
    if(ulStatus)
    {
        UARTprintf("Unhandled EP interrupt 0x%08x!\n", ulStatus);
    }
}

//*****************************************************************************
//
// Called by the USB stack whenever a configuration change occurs.
//
//*****************************************************************************
void
HandleConfigChange(unsigned long ulIndex, unsigned long ulInfo)
{
    UARTprintf("USB configuration change 0x%08x\n", ulInfo);

    //
    // Save this change in state.
    //
    g_ulUSBConfigured = ulInfo;

    //
    //
    // The host setting the configuration indicates to us that we are now
    // connected so update the device state.
    //
    g_eDeviceState = DEVICE_WAITING_FOR_HELLO;
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a bus reset occurs.
// We use this notification to tidy up and get back into an idle state in
// preparation for reconnection.
//
//*****************************************************************************
void
HandleReset(unsigned long ulIndex)
{
    UARTprintf("USB reset - cleaning up.\n");

    //
    // Reset the states of all our endpoints.
    //
    CleanUpOnDisconnect(false);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the host
// disconnects.  We use this notification to tidy up and get back into an
// idle state in preparation for reconnection.
//
//*****************************************************************************
void
HandleDisconnect(unsigned long ulIndex)
{
    UARTprintf("USB host disconnected - cleaning up.\n");

    //
    // Reset the states of all our endpoints.
    //
    CleanUpOnDisconnect(true);
}
